Revit 2024 API
BoundaryConditions.AssociatedLoadId Property
 The Id of the internal load element associated with a boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ElementId AssociatedLoadId { get; set; }
Visual Basic
Public Property AssociatedLoadId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ AssociatedLoadId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 ElementId may be set if the internal load exists and it's type fit the BoundaryConditions type only (Point, Line and Area).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: elementId is not a valid Element identifier. -or- When setting this property: Throws when the ElementId does not refer to the internal load with appropriate type.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace